In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [6]:
ser1 = Series([0,1,2], index=['A','B','C'])

ser1

A    0
B    1
C    2
dtype: int64

In [9]:
ser2 = Series([3,4,5,6], index=['A','B','C', 'D'])

ser2

A    3
B    4
C    5
D    6
dtype: int64

In [10]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [13]:
# dataframes
df1 = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'), index=['SF','LA'])
df1

    A  B
SF  0  1
LA  2  3

In [20]:
df2 = DataFrame(np.arange(9).reshape((3,3)), columns=list('ADC'), index=['SF','LA', 'NY'])
df2

    A  D  C
SF  0  1  2
LA  3  4  5
NY  6  7  8

In [15]:
df1 + df2

      A   B   C   D
LA  5.0 NaN NaN NaN
NY  NaN NaN NaN NaN
SF  0.0 NaN NaN NaN

In [16]:
# replacing null values
df1.add(df2, fill_value=0)

      A    B    C    D
LA  5.0  3.0  5.0  4.0
NY  6.0  NaN  8.0  7.0
SF  0.0  1.0  2.0  1.0

In [17]:
# operation between series and dataframes

In [18]:
ser3 = df2.ix[0]
ser3

A    0
D    1
C    2
Name: SF, dtype: int32

In [21]:
df2-ser3

    A  D  C
SF  0  0  0
LA  3  3  3
NY  6  6  6